# =====================================================================
# ste_cos:egg/egg_check_cell
# AS ste_cos_egg_scanner AT сканера. Проверка текущей клетки.
#
# Если в позиции сканера block dragon_egg:
#   - если маркера-указателя нет — создать его на 1 блок выше яйца
#   - если есть — телепортировать поверх яйца (яйцо могло телепортнуться)
# =====================================================================

execute if block ~ ~ ~ minecraft:dragon_egg run function ste_cos:egg/egg_sync_marker
